[{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Tobiloba Lawal",
  "text": "I recently had the opportunity of experiencing exceptional care at Abiodun Falade Hospital, where I underwent successful surgery without any complications. The doctors and nurses are competent. They didn’t only deliver top-notch medical care but also compassionate humanely care. I was impressed with the hospital's commitment to providing quality care, addressing my physical and emotional needs throughout my stay. I'm extremely satisfied with the medical care and service I received at Abiodun Falade Hospital. I am grateful for the experience. I highly recommend this hospital to every woman seeking quality healthcare.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "2 days ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Ayo Mi",
  "text": "Satisfactory",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "2 days ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Olufemi T. Johnson",
  "text": null,
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a week ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Esther Ajayi",
  "text": "Highly recommended!!!",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "2 weeks ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "bidemi Olatunji",
  "text": "Nice one",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a month ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Mary Magdalene Olayinka",
  "text": "Exceptional care and support from all the medical teams. Highly recommended hospital",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a month ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Rosemaryjane",
  "text": "I had a very wonderful experience.The hospital is very neat and beautiful, the doctors and nurses are very caring. The surgeon carefully removed every fibroid in my womb and outside, now I can leave  my normal life. May God continue to bless Dr Abiodun falade and his team in Jesus's amen.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "4 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Grace Elughi",
  "text": "It was a wonderful experience. The nurses and doctors are really caring. They are God sent to mankind. I would recommend Abiodun Falade Hospitals anytime any day.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "4 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Nelly Ogochukwu Daniel",
  "text": "I recently underwent surgery at Abiodun Falade Hospital Abuja, and I must say I was very impressed with the quality of care I received. The staff were all attentive and caring, and the doctors were knowledgeable and reassuring. The hospital itself was very clean, with cleaners coming around to clean twice a day which made me feel comfortable during my stay.\n\nI was also very pleased with the speed of my recovery after the surgery. I experienced a rapid recovery. As of 24 hours post-surgery, I was able to walk downstairs without support and even walked around the hospital to stretch my legs.\n\nThe doctors and nurses provided excellent post-surgery care which helped me heal very fast.\n\nThanks to Dr. Gloria for providing me with emotional support the very first day I visited the hospital for consultation because I was really scared of surgery.\n\nMy biggest fear was having scars after the surgery, but to my surprise I have no visible scar, just a thin line that is hardly noticeable.\n\nHonestly, I was extremely satisfied with my experience at Abiodun Falade Hospital and would not hesitate to recommend it to anyone in need of medical care, especially Myomectomy.\n\nThe nurses I met were all nice, but Chiamaka is my favorite nurse.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "5 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Oluwatosin Adeyemi",
  "text": "I'm deeply grateful for the exceptional care giving to me during my fibroid surgery.\nThe Doctors and the nurses are friendly and very nice in hospitality, making me to feel at home.\nThe surgery was a success, as expected from the moment I got admitted. ABIODUN FALADE HOSPITAL ABUJA is highly recommended to anyone in need of medical care especially myomectomy.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "5 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Christopher McWealth",
  "text": "My wife and I had an incredible experience at Abiodun Falade Hospital Foundation during my wife's Fibroid Surgery.\nThe staff was incredibly warm and welcoming, making us feel right at home. The doctors (Dr. Falade, Dr. Gloria & Co.) and nurses were highly skilled and attentive, providing excellent care throughout our stay; especially Nurse Chiamaka. The facilities were clean and comfortable. I highly recommend this hospital for anyone in need of a top-notch medical care.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "5 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Tobiloba McWealth",
  "text": "My experience with Abiodun Falade Hospital Foundation Abuja was homely. From the first consultation to my pre, during and post surgery was excellent. Tho, i had my fears initially but i had the assurance i was in good hands. Wonderful teamwork from the Dr in charge to the nurses even the cleaners. The love and care i received was top notch and everyone who visited me during my admission gave them the accolade. God is really in this place cos, it is very glaring. Abiodun Falade, nothing dies in your hands in Jesus’ name🙏🏾 I will recommend Abiodun Falade hospital over and over. Such a wonderful family❤️. 💯\n\nMrs McWealth.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "5 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Epunam Happiness",
  "text": "When I first visited for consultation, I was scared but after speaking with dr Gloria. My heart wholely accepted undergoing the surgery with them. During and After the surgery the nurses and doctors were so patient and friendly with me. I’m glad I made the decision to have my surgery with them.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "7 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Onyedikachi Akwiwu",
  "text": "Service was topnotch, the Staff were so good, and professional. Thank you for your service and giving women the opportunity to get free from fibroid.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "7 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Vivian Chioma",
  "text": null,
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "7 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "B.B Hairs",
  "text": "My surgery was very smooth, the doctors and nurses are very friendly, neat and nice environment. All thanks to the Doctors Gloria and all the nurses in Abuja branch you guys are the real MVP.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "7 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Lymah Usman",
  "text": "At first i was scared...but from the top of the staffs at the hospital to bottom is a 100/10. The best place to get treated and healing at the same time.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "7 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Oluwafadesikemi Adewale",
  "text": "I had a highly satisfactory experience at Abiodun Falade Hospital and Foundations during my recent surgery. The surgeons and doctors were extremely competent, ensuring excellent care. The nursing staff was friendly and supportive, significantly aiding my recovery. The hospital had a home-like atmosphere, thanks to the proactive cleaning staff, with no typical hospital smell. Overall, the combination of skilled professionals and a comforting environment made for a positive surgical experience.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "7 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Bello Ramatu",
  "text": "Abiodun Falade Hospital is highly recommended, super conducive environment with loving and caring Nurses and Doctors even down to the cleaners.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "8 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Rachel Madziga",
  "text": "I enjoyed my stay in the hospital.The hospital was very clean and their nurses worked round the clock.\nI would definitely recommend friends and family here",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "8 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Bisola Adesina",
  "text": "Service was great. Staff were friendly and accommodating. Would definitely recommend.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "9 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Bolanle Raji",
  "text": "Had a great experience. The doctors and nurses were exceptional.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "9 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Libra30-9 Enterprise",
  "text": "When you are looking for a very good hospital to have fibroids surgery think of Abiodun Falade Hospital.The entire team displayed professionalism and they are good at what they do. The doctors and nurses are friendly and very nice. Thank you Abiodun Falade hospitals. I highly recommend them.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "10 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Mary Maeyen Ossai",
  "text": "I had a wonderful, stress free and memorable moments in the Abiodun Falade Hospital, Abuja.\n\nAll the Doctors, nurses, cleaners and security personnel were friendly and nice. I felt save in everyone's care.\n\nSpecial thanks to Dr. Abiodun Falade for your great expertise, Dr. Gloria and the entire medical team for a job well done. You did a good job and God perfected everything.\n\nYour service, attention to details, care and love is worthy of recommendation.\n\nKeep up with the good work of saving especially the lives of women battling the sting of fibroid.\n\nOnce again, thank you and thank God Almighty. It was really worth it.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "10 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Jemimah Iso",
  "text": "I had the best hospital experience. Great Doctor and the Nurses were so professional  and caring.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "10 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Joy Vincent",
  "text": "Care givers  in the hospital are top notch and the doctors are careful and approachable.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "11 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Asemota Treasure",
  "text": "I'm deeply grateful for the exceptional care giving to my sister  during her recent fibroid surgery. From the attentive nurses to the skilled surgical team, everyone made her feel supported and confident throughout her stay. The immaculate facilities and calming atmosphere further enhanced my experience. Thank you for your dedication to excellence in patient care.With heartfelt appreciation.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "11 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Iyabo Animashaun",
  "text": "My experience in the hospital was amazing and I really enjoyed my stay from the first day I entered. The staffs are welcoming and loving ❤️.  I'm sure I will miss them so much.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "11 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Rasheedat Aliyu",
  "text": "I had an amazing experience being admitted at Abiodun Falade Hospital. It was one that cleared all my fears for being admitted in a hospital because I’ve always had bad experience with hospitals which I thought was a norm. Even though I came in for a surgery the process was too smooth that I became 100% certain I was in safe hands, from the doctors, nurses, down to cleaners and guards, the professionalism they displayed is one to none.\nThe surgery was a success, as expected from the moment I got admitted! Abiodun Falade Hospital Abuja comes highly recommended from me.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "11 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Femi Ibrahim",
  "text": "I commend all d staff in d hospital they are doing wonderfully well.\nTheir service is superb.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "11 months ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Amara Maryann",
  "text": "To all my ladies out there single or married that has fibroid and you're scared of surgery like me, you are sacred of errors and complications of surgery, I tell you one thing Abiodun Falade Hospital got you Covered:\n\n1.Dr Falade will make sure he remove the minutest fibroid from you that, there will be no case of fibroid regrowth after surgery\n\n2. He has the best nurses in the world that will take good care of you.\n\n3. He has best cleaners that keeps the hospital facilities clean and free from drug stanch that will make you not to feel that you're in the hospital.\n\nI followed them closely for 2years on IG before I had my surgery with them and I am happy that I made the right choice. Visit them on any of their branches in Lagos, ibadan, PH and Abuja depending on your location, and be free of fibroid.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Chinyere ikechukwu",
  "text": "God bless Dr Abiodun Falade\nFrom the CMD, the doctors, Nurses down to the hospital environment is just superb. I will surely recommend Abidoun Falade hospitals anyday anytime because they are good at what they do. With my full chest I must say you guys are the best",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Egwu sarah",
  "text": "I really appreciate facade hospital for a successful surgery ,the nurses are nices",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "P D",
  "text": "Was a hospital, but a home to me. From the main doctor (surgeon), doctor Okoli, the nurses (Vivian, Favour, Esther, Chi, Victor, Maria, Dami), the receptionist and lab scientist are the best EVER. Professionalism 💯, Hospitality 💯 and 💯 friendly. I love them so much, wish them the best things life would offer and would surely miss them. They're my new family 💯💎♥️",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Stella Ohanekwu",
  "text": null,
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Tamaradoubra Afoegba",
  "text": "I had my myomectomy surgery at Abiodun Falade Hospital and all I can say is Dr Abiodun is God’s gift to women with Fibroids!!! I was so afraid of doing this surgey and finally I made up my mind and then stumbled on the 40 women surgery programme he was offering in January.\nNow I am fibroids free and ready to live a beautiful life!! We give God all the glory for everything and thank you Abiodun Falade hospital Abuja for your care towards your patients.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Omolara Ageloye",
  "text": "Absolutely refreshing. The Doctors, nurses, and cleaners are topmost professionals. No regrets!",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "mercy odugbemi",
  "text": "I have started recommending this hospital to everyone that has asked about my experience. From the point of consultation to my post op experience it was awesome. This hospital has the best team attending to me. I have heard stories of nurses that don’t really care but the nurses are angels. Thank you Abiodun Falade Hospital for a great service.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "rosemary onuh",
  "text": "Abiodun Falade Hospital is the safest  and most reliable hospital for any fibroid surgery. The Doctors and nurses are exceptionally good at what they do.  So welcoming, caring and supportive 💖.  You should visit them and experience their services for your fibroid cases. God bless Abiodun Falade Hospital for helping me through this phase of my life   I'm highly pleased",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "HALIMA ISTIFANUS",
  "text": "I had a myomectomy few days ago, and it was such a seamless experience.\nThe hospital was well equipped, the doctors and nurses were professional and just great for a perfect recovery.\nI highly recommend this hospital. Kudos to the team!",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Evelyn Joel-Ashade",
  "text": "Excellent medical services. I had no regrets coming to this hospital. I highly recommend this hospital for others.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Folakemi Osunniran",
  "text": "It was a good job and we bless Almighty God for his work through the wonderful doctor falade.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Louise Osikwemhe",
  "text": null,
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Christy Ayena",
  "text": "From the first time I stepped foot in Abiodun Falade Hospital Abuja, it has been a wonderful experience. From the first appointment to the time of surgery was back to back follow up which made me know that I was in good hands. From Surgery to post surgery till the day I was discharged, all hands were on deck. From the doctors to the nurses to the cleaning staff and the security God bless you all.\nYou can't go wrong with Abiodun Falade Hospitals",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 4,
  "name": "Rahila blessing Alhassan",
  "text": "At first, I was scared of surgery but God open my eyes, I found Abiodun Falade hospital online and immediately my heart accepted to go for the surgery and the surgery was successful. The staffs are so professional in their work. Thank you so much Dr Falade, Dr Gloria, Nurse Danjuma, Nurse Favour, Nurse Miriam, Nurse Victor, to mention but few May God bless you all  and give you more knowledge and wisdom.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Ugomma Obi",
  "text": "I have been very scared of fibroid removal surgery since I was diagnosed of it in 2019 until I found Abiodun Falade Hospital on an IG sponsored post. Immediately, my heart accepted it and I felt peace instantly. After attending the free fibroid screening and consultation at their Abuja hospital in July, 2023 I Made up my mind to have my surgery done here and I do not regret it. You'll know the CMD is intentional about the wellbeing of his patients from how all the staff (from doctors to security personnel) treat patients. The hospitality, preoperative care and postoperative care is 5 star. The doctors and nurses are all awesome. Special appreciation to Dr. Abiodun, Dr. Gloria, Nrs. Onuh, Nrs. Miriam, Nrs Chiamaka and Nrs Victor. You're the best Dr Abiodun and God will continue to bless you as he continue to use you as an instrument to help women 🙏🏽",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "bidemi quadir",
  "text": "I had a wonderful experience with Abiodun Falade Hospital. The Doctors were extraordinary surgeons, the nurses and the staff were always helpful and kind. They ensured I had a smooth prep, surgery, and follow-up. I am so glad I chose Abiodun Falade Hospital and would highly recommend it to anyone.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Mary Ochom",
  "text": "I really do appreciate Abiodun Falade Hospital for a successful surgery on my sister. I can beat my chest to say this hospital is the best. She  got relieved of the pains shortly after the surgery. The Doctors and the entire crew are wonderful people. The hospitality we got from them is comparable to non. I love you all. Keep the light burning.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Joke Ovie",
  "text": "My experience at this facility was amazing. Excellence at its peak. From my consultation to the hospitality , to post up care every step was on point. Never met a more professional and dedicated team as this. Extremely patient Doctors and Nurses. They always show up with a smile . Thinking of getting those  little monsters out?  No  better place to get it done; than Abiodun Falade Hospital.\nA very big thank you to Dr. Falade and his entire team. 🙏 God bless you all for your great service to humanity.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Nchelem Oluchi",
  "text": "I have been visiting hospitals but coming here gave me a totally different experience..The Doctor's are so professional, experienced, kind, jovial and good..As for the nurses, OMG they offer top notch clinical services.. I will choose this medical facility over and over again.. infact you guys have given me a life long job of referring everybody I know to go your facility.. I really want to appreciate all of you for beautiful services.. I'm honoured to have to had my surgery here..",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "idris treasure",
  "text": "The Doctors and staffs were really friendly and the environments was neat + their services for fibroid surgery was top notch",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "john judylyte",
  "text": "Wowwwww my experience was great, their facilities are superb, the doctors, nurses and the whole staff are professionals and good at their job, they are like family to me now, they made me feel at ease,  thank you all for making me feel loved and cherished. Bigups to Dr AbiodunFalade, thank you for using your gift to save humanity, Dr Abiodunfalade Hospital Is the best of the best. Thanks again to the whole staff,  I love you all,  you guys are amazing.  God bless you all.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Tijani Aisha",
  "text": "My recent experience at Abiodun Falade was exceptional.First and foremost, I want to extend my heartfelt gratitude to the entire staff at Abiodun Falade as  I must admit that I wasn't in the best mood when I arrived and was a cranky patient, but the patience and kindness displayed by all members of the team, including the domestic workers truly impressed me. They understood that sometimes patients can be difficult, but they never let it affect the quality of care they provided.The hospital staff displayed remarkable professionalism, patience, and compassion throughout my treatment. The medical team's competence, clear communication, and commitment to patient comfort were outstanding. The hospital's attention to detail, efficiency in administrative processes, and effective communication with both patients and their families were particularly noteworthy. I wholeheartedly recommend Abiodun Falade Hospitals to anyone seeking high-quality medical care especially for fibroids and reproductive healthcare. All of the staff go beyond and above the call of duty. They turned my initial crankiness into genuine appreciation. Thank you, Abiodun Falade Hospitals, for making a significant positive impact on my life.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Rachael Adipue",
  "text": null,
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Faith Tessy",
  "text": "I had a fibroid surgery eleven years ago and the monster came back. This time bigger, more painful, and with much bleeding. I took all sorts of concotion because I was scared of going for another surgery but none ever worked. God opened my eyes and I found Abiodun Falade Hospital online and immediately my heart accepted it. The surgery was a success and the staff, so professional in their work. Thank you Dr Falade, thank you Dr Micah, Dr Dum,  Dr Glory, Nurse Danjuma, and all the loving nurses that took care of me. I am glad I met you guys.\nA piece of advice, stop taking that concoction that  will not work and may even damage your organs. Go to Abiodun Fade hospital and get it done with and you will be glad you did.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "ADENIYI GRACE",
  "text": "Firstly I want to appreciate God for ordering my step to Biodun Falade hospital.\nIt is a great privilege using this hospital, my experience with the management and all the staffs is such an amazing one. Falade's hospital as standard equipments, God fearing staffs who will make your dream come through.\n\nTo the glory of God I had a successful delivery, my special thanks to the MD for your prayers and concern, to the doctors, nurses and all the health workers your love, care and encouragement is great. You are such a wonderful people infact you are the best.\nPlease keep on the good work.\nThe environment is superb.\n\nAm proud to recommend this hospital to anyone that need the best health care in F.C.T and other branches.\nGod bless you all.\nThanks alot.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Omowumi Aina",
  "text": "I noticed my fibroid years ago but fear wouldn’t let me consider going for the operation, until I came across dr Abiodun Falade’s Instagram page. I summoned courage and came for my first consultation and I instantly knew this was the place for me. Fast forward to the surgery,I was anxious but with the help of the doctors & nurses who were tremendously positive and supportive, it went amazingly well. All the staff were compassionate and caring all through, My stay at their facility was more of a mini vacation than admission lol, special thanks to Dr Abiodun, Dr Dumms,Dr Shehu,Dr Gloria, nurse Favour, nurse Nafisat, nurse Victor, nurse Amina and for the rest which I can’t remember their names,I say a very BIG THANK YOU.I would 💯 recommend their service to anyone who is having second thought about this procedure,you will NOT regret taking this bold step.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Olamma Rufina",
  "text": "So I had fibroid and was too scared to remove it for over 2 years, but I came across this hospital online and for some reason, my heart accepted them and it was very weird for someone that has never done any surgery in my life.\nI had the surgery and to God be the glory, it was very successful, the doctors and nurses were very friendly and understanding, even in the theater, they held me like their own.\nThey helped me through the process, I was never alone.\nThere was 24hrs check up from them every now and then.\nThe consultant and the main doctor were the nicest doctors I have come across.\nI even noticed the way they treat their staff, they are like one big family and I must say, thank God for leading me to this particular hospital.\nNo complications, very professional and at the same time they treated me like family.\n\nThank you to the nurses and doctors that Hod used to heal me.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "JENNIFER BEKES",
  "text": "From the consultation, to the hospitality, to the post op care, all i can say is top notch services, They are worth every dime. Each member of the surgical team was just amazing, the head consultant, dr abiodun falade is nothing but a delight, he made it feel like it was just another day of strolling in and out of the house. One of favorite team of humans has to be the nurses, there night nurses and day nurses, are gentle and warm. They made my journey easy and comfortable. Facility is clean, comfortable and best of all safe. So big thank you to the whole abiodun falade team.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "oluwafemi osilaja",
  "text": "Good services. Good environment. Very professional staff.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "YZ Channel",
  "text": "This hospital is absolutely amazing, the hospitality  is something else.\nThe nurses are well trained (real care givers) there’s unity here, the doctors know there job. With the help of God am healed.\nIn fact i never wanted to be discharge\nI love you all.\nMy mum said >> this hospital will be like the serpent Moses raised in the wilderness, everybody that look up to the serpent shall be healed of any diseases.\nMore wisdom!\nGod bless ABIODUN FALADE HOSPITAL.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Ms. Og",
  "text": "My sister- Caroline Anyanwu had a successful surgery.\nIt was a wonderful experience with Abiodun Falade Hospital.\nDr. Falade, Dr. Duum and the entire team that carried out the operation were indeed amazing.\nDealing with numerous patients in a well systematic manner, highly qualified and well experienced. They were so polite and extremely helpful, ensuring I had a smooth prep, surgery, and follow-up.\nDr. Gloria, Dr. Micah and the Nurses (Vivian, Favor, Victor and Amina) myself, my sisters and friends are so grateful for the successful operation and we say thank you all and we would highly recommend to anyone.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Clarissa Henshaw",
  "text": "When I discovered that I had Fibriod I was so worried and scared. I was going through Instagram and I came across Abiodun Falade hospital and immediately I got glued to his page,I saw all the surgeries that he did and I decided to come for consultation at the Abuja branch.From the receptionist to the Doctors and let me not forget the Nurses were so friendly.\nI was booked for surgery and by his grace all the Fibriods are out.Dr Abiodun and his team of Doctors were so funny,I was laughing when the surgery was going on.\nAnd the Nurses took good care of me,I felt like I was in a 5 star hotel that made my recovery fast because I was always seeing smiling faces.Dr Abiodun Falade may the good Lord continue to bless you and all your team of Doctors and Nurses.I am finally free from Fibriods.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "okeoghene Clifford Blasu",
  "text": "Excellence at is peak , I had a surgery done here in abuja, let me start with all the Dr's and the nurses, kind hearted people feel the pain with you . Very helpful even midnight.  They will come and check up on u. Dr Okoli, Dr. Micah the singer with a lovely voice.  Dr Favour very peaceful.  Oh Nurse Ghaniyat,  Nafisat,  Miraim , Victor , Amina you are a great team. Always happy ready to support, may God bless you all richly . Dr Afalade Dr . Dunes. I never seen Dortors like you before , thank you for giving me hope for child again I love you all and my entire family is so grateful 🙏Abiodun Falade Hospital Abuja is the right place to be.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Lot Rebecca",
  "text": "The hospital is top notch\nMedical service at its peak\nFriendly nurses\nDoctors are overseas standard\nI actually have little or no complaints.\nHighly commendable.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Cynthia Awele",
  "text": "Honestly, Abiodun Falade Hospital Abuja is not just the usual hospital but a hospital with God at work in it. Everything is working well, from the doctors, nurses, cleaners, lab etc, everyone is so good at what they do.\nI'm saying a very big thank you to doctor Falade, the doctors, nurses and everyone there for allowing God to bring healing to patients through your care. Thank you and God bless you.\nI have been telling everyone I know about Abiodun Falade Hospital Abuja and will continue to recommend the hospital to as many as I know because this is the best hospital from my experience.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Peace Williams",
  "text": "I had my fibroid surgery recently here and I was in the best of hands from the doctors to the nurses.I was treated very nicely and I will definitely be recommending people because I know they will be in safe hands.well done guys 👍",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Tama Georing",
  "text": "What more can I say other than be thankful first to God, then to the Doctors and Nurses. Infact you guys did an amazing job for my elder sister and we are saying thank you.\n\nHonestly, I really didnt think this would have been possible if not for your assistance.\n\nLet me also thank Sis Ann for the referral, God bless you Sis.\n\nIf you are in Abj and it's environs, please visit Abiodun Falade Hospitals and you won't regret it.\n\nTheir hospitality is top notch, from clean and neat environment, to friendly and playful Doctors and Nurses. Like for a second you won't even think you are in the hospital.\n\nMore of God's grace to continue with the good work.\nGod bless Abiodun Falade Hospitals",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Temidayo Yejide",
  "text": "The best hospital ever .  They are the best\nTheir Drs , nurses , cleaners\nI really enjoy their services\nGod bless them and the hospital will go places in jesus mighty name .Adetunji Folasade",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "a year ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Oyinkansola Gandonu",
  "text": "Have been to hospitals in this Abuja. None is Good like Abiodun Falade hospital Abuja. The CMD is so Lovely. The Nurses are the Best.The Environment so Beautiful. THE DOCTOR'S  ARE SO SO Caring and Have this Healing Hand.The Hospital is bless. Thank You Abiodun Falade hospital for Taking care of me. We see very soon for Baby Delivery.  Love you all❤❤❤ My Abuja people visit This Hospital and you wont Regret it.",
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "2 years ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Ohuabunwa Patricia",
  "text": null,
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "2 years ago"
},
{
  "title": "Abiodun Falade Hospitals Abuja",
  "stars": 5,
  "name": "Mz_awnuhh (Glee)",
  "text": null,
  "neighborhood": "FCT",
  "location": {
    "lat": 9.1207437,
    "lng": 7.377217
  },
  "categoryName": "Hospital",
  "city": "Abuja",
  "publishAt": "2 years ago"
}]